<template>
  <div>
    <h1>复制粘贴</h1>
<h2>复制粘贴画布内的节点</h2>
<p>你可以通过选中某个节点，然后按<code>ctrl</code>+<code>c</code>快捷键来复制节点，如果选中多个节点，目前只支持复制第一个节点，然后点击你要复制到的节点，按<code>ctrl</code>+<code>v</code>快捷键粘贴即可。</p>
<p>除了快捷键，也可以通过右键菜单来操作。</p>
<h2>支持粘贴剪贴板中的数据</h2>
<p>当你选中某个节点后，直接按<code>ctrl</code>+<code>v</code>快捷键时，如果你的剪贴板中有数据，会粘贴你剪贴板中的数据，目前支持文本和图片两种格式，如果你的剪贴板中有图片，那么会将图片粘贴到你选中的节点里，如果存在文本，那么会以该文件创建一个子节点。</p>
<p>如果你的剪贴板中存在数据，又在画布里复制了节点数据，那么是以谁最后改变了为准。</p>
<h2>支持跨浏览器标签、跨浏览器复制</h2>
<p>如果你在多个浏览器里打开了思维导图编辑页面，那么可以复制一个页面的节点数据到另一个页面进行粘贴。</p>
<p>在客户端场景下打开了多个编辑页面时比较常用。</p>
<h2>支持粘贴知犀思维导图数据</h2>
<p>目前支持复制知犀思维导图的节点数据粘贴到本思维导图里。</p>

  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>